# 数据集
+ merge合并：根据键值，连接合并各列，成为一个新的DataFrame
+ join连接：

In [3]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame
from numpy import reshape

# merge合并，相关函数
+ ***how***:指定连接类型,包含‘outer’'left''right''inner'
+ ***left***:左连接
+ ***right***:右连接
+ ***outer***:外连接，取并集
+ ***inner***:内连接，取交集
+ ***on***:用于指定连接的列名
+ ***left_on***:左侧DataFrame中的某列 用作连接键
+ ***right_on***:右侧DataFrame中的某列 用作连接键
+ ***right_index***:将右侧的行索引用作其连接键
+ ***left_index***:将左侧的行索引用作其连接键

In [8]:
df1=DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [9]:
df2=DataFrame({'key':['a','b','d'],'data1':range(3)})
df2

  key  data1
0   a      0
1   b      1
2   d      2

In [10]:
pd.merge(df1,df2)

  key  data1
0   b      1

In [30]:
#基于连接键‘key’的连接，默认取交集
pd.merge(df1,df2,on='key')

  key  data1_x  data1_y
0   b        0        1
1   b        1        1
2   b        6        1
3   a        2        0
4   a        4        0
5   a        5        0

In [12]:
df3=DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [14]:
df4=DataFrame({'rkey':['a','b','d'],'data2':range(3)})
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

### 不同列名合并时,默认取得inner交集

In [24]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')#不同列名合并时是inner交集，需要指定左右两边链接列名

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [29]:
#基于连接键的外链接outer,取得并集
pd.merge(df1,df2,how='outer')

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6
7   a      0
8   d      2

In [35]:
#基于连接键的左连接left
pd.merge(df1,df2,on='key',how='left')

  key  data1_x  data1_y
0   b        0      1.0
1   b        1      1.0
2   a        2      0.0
3   c        3      NaN
4   a        4      0.0
5   a        5      0.0
6   b        6      1.0

In [33]:
#基于连接键的inner连接，取交集
pd.merge(df1,df2,on='key',how='inner')

  key  data1_x  data1_y
0   b        0        1
1   b        1        1
2   b        6        1
3   a        2        0
4   a        4        0
5   a        5        0

In [37]:
left=DataFrame({'key1':['foo','foo','bar'],'key2':['one','two','noe'],'lval':[1,2,3]})
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  noe     3

In [39]:
right=DataFrame({'key1':['foo','foo','bar','bar'],'key2':['one','one','one','two'],'rval':[4,5,6,7]})
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [44]:
pd.merge(left,right,on=['key1','key2'],how='outer') #多列匹配，key1和key2

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  noe   3.0   NaN
4  bar  one   NaN   6.0
5  bar  two   NaN   7.0

In [45]:
pd.merge(left,right,on=['key1','key2'],how='inner')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5

In [47]:
pd.merge(left,right,on=['key1'],how='inner') #不考虑key2

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    noe     3    one     6
5  bar    noe     3    two     7

### 索引上的合并
+ 当连接键位于其索引中时，可以传入left_index=True或right_index=True,说明索引应该被用作连接键

In [77]:
left1=DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [78]:
right1=DataFrame({'group_val':[3.5,7]},index=['a','b'])
right1

   group_val
a        3.5
b        7.0

In [81]:
#left_on='key'是左连接键；right_index=True是右连接键（这个是DF的索引作为连接键）
pd.merge(left1,right1,left_on='key',right_index=True) #交集

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [84]:
pd.merge(left1,right1,left_on='key',right_index=True,how='outer') #并集

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [88]:
left2=DataFrame({'key':['one','one','two','three'],'value':range(4)},index=['a','b','c','d'])
left2

     key  value
a    one      0
b    one      1
c    two      2
d  three      3

In [91]:
#连接左右两边的DataFrame都用索引作为连接键
pd.merge(left2,right1,left_index=True,right_index=True) #交集

   key  value  group_val
a  one      0        3.5
b  one      1        7.0

### join使用
+ 合并多个带有相同或相似索引的DataFrame,不管他们之间有没有重叠的列

In [99]:
left2.join(right1)#左右两边DF通过索引作为连接键，合并列

     key  value  group_val
a    one      0        3.5
b    one      1        7.0
c    two      2        NaN
d  three      3        NaN

In [101]:
left1.join(right1,on='key')#左边是连接键，右边是索引作为连接键

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [93]:
left2.join(right1,on='key')

     key  value  group_val
a    one      0        NaN
b    one      1        NaN
c    two      2        NaN
d  three      3        NaN

In [112]:
right2=DataFrame({'right2':[9,7.7]},index=['c','d'])
right2

   right2
c     9.0
d     7.7

In [114]:
right3=DataFrame({'right3':[1.1,2.2]},index=['c','f'])
right3

   right3
c     1.1
f     2.2

In [115]:
#3个DF连接
right3.join([right1,right2])

   right3  group_val  right2
c     1.1        NaN     9.0
f     2.2        NaN     NaN

In [52]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [53]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [51]:
df3.join(df4,how='left')

  lkey  data1 rkey  data2
0    b      0    a    0.0
1    b      1    b    1.0
2    a      2    d    2.0
3    c      3  NaN    NaN
4    a      4  NaN    NaN
5    a      5  NaN    NaN
6    b      6  NaN    NaN

In [54]:
df3.join(df4,how='right')

  lkey  data1 rkey  data2
0    b      0    a      0
1    b      1    b      1
2    a      2    d      2

In [55]:
df3.join(df4,how='outer')

  lkey  data1 rkey  data2
0    b      0    a    0.0
1    b      1    b    1.0
2    a      2    d    2.0
3    c      3  NaN    NaN
4    a      4  NaN    NaN
5    a      5  NaN    NaN
6    b      6  NaN    NaN

In [56]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [57]:
df2

  key  data1
0   a      0
1   b      1
2   d      2

In [66]:
df3.join(df4,how='left',)

  lkey  data1 rkey  data2
0    b      0    a    0.0
1    b      1    b    1.0
2    a      2    d    2.0
3    c      3  NaN    NaN
4    a      4  NaN    NaN
5    a      5  NaN    NaN
6    b      6  NaN    NaN

### concat使用方法,轴向连接
将没有重叠索引的Series粘合在一起

In [70]:
s1=Series([0,1],index=['a','b'])
s1

a    0
b    1
dtype: int64

In [71]:
s2=Series([2,3,4],index=['c','d','e'])
s2

c    2
d    3
e    4
dtype: int64

In [72]:
s3=Series([5,6],index=['f','g'])
s3

f    5
g    6
dtype: int64

In [76]:
pd.concat([s1,s2,s3])#默认是axis=0

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [74]:
pd.concat([s1,s2,s3],axis=1)#axis=1是列；#axis=0是行

e:\python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

# 合并重叠数据

In [119]:
a=Series([np.nan,2.5,np.nan,35,4.5,np.nan],index=['f','e','d','c','b','a'])
a

f     NaN
e     2.5
d     NaN
c    35.0
b     4.5
a     NaN
dtype: float64

In [121]:
b=Series(np.arange(len(a),dtype=np.float64),index=['f','e','d','c','b','a'])
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [123]:
b[-1]=np.nan
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [124]:
np.where(pd.isnull(a),b,a)

array([ 0. ,  2.5,  2. , 35. ,  4.5,  nan])

In [125]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

# 重塑和轴向旋转